# coding=utf-8
"""
@Author: Freshield
@Contact: yangyufresh@163.com
@File: a132_nim_game.py
@Time: 2022-10-22 23:30
@Last_update: 2022-10-22 23:30
@Desc: None
@==============================================@
@      _____             _   _     _   _       @
@     |   __|___ ___ ___| |_|_|___| |_| |      @
@     |   __|  _| -_|_ -|   | | -_| | . |      @
@     |__|  |_| |___|___|_|_|_|___|_|___|      @
@                                    Freshield @
@==============================================@
"""


def nim_game(n):
    """
    nim游戏，1-3块石头，如果你是先手，会不会赢
    如果你是4的倍数则会输，否则会赢，因为移动到4的倍数就能保证是最后拿
    """
    return n % 4 != 0


if __name__ == '__main__':
    n = 4
    print(nim_game(n))
