# coding=utf-8
"""
@Author: Freshield
@Contact: yangyufresh@163.com
@File: num0292_canWinNim.py
@Time: 2020-04-28 22:10
@Last_update: 2020-04-28 22:10
@Desc: None
@==============================================@
@      _____             _   _     _   _       @
@     |   __|___ ___ ___| |_|_|___| |_| |      @
@     |   __|  _| -_|_ -|   | | -_| | . |      @
@     |__|  |_| |___|___|_|_|_|___|_|___|      @
@                                    Freshield @
@==============================================@
"""


class Solution:
    """
    你和你的朋友，两个人一起玩 Nim 游戏：桌子上有一堆石头，每次你们轮流拿掉 1 - 3 块石头。
    拿掉最后一块石头的人就是获胜者。你作为先手。
    你们是聪明人，每一步都是最优解。 编写一个函数，来判断你是否可以在给定石头数量的情况下赢得游戏。
    解法：
    只要你拿的是4的倍数，那么无论你怎么拿，对手都能变成4的倍数，然后你就输了
    """
    def canWinNim(self, n):
        return n % 4 != 0



if __name__ == '__main__':
    n = 4
    print(Solution().canWinNim(n))